app/controllers/application_controller.rb

  def index
    @hashes_count_total = Pwhashes.all.count
    @cleartext_count_total = Passwords.all.count
---
SELECT COUNT(*) FROM "pwhashes"
SELECT COUNT(*) FROM "passwords"