app/controllers/cleartext_controller.rb

SELECT "passwords".* FROM "passwords"
---
  def index
    @cleartext = Passwords.all

SELECT "passwords".*, ((ts_rank((to_tsvector('simple', coalesce("passwords"."cleartext"::text, ''))), (to_tsquery('simple', ''' ' || 'hello' || ' ''')), 0))) AS pg_search_rank FROM "passwords" WHERE (((to_tsvector('simple', coalesce("passwords"."cleartext"::text, ''))) @@ (to_tsquery('simple', ''' ' || 'hello' || ' ''')))) ORDER BY pg_search_rank DESC, "passwords"."id" ASC
SELECT COUNT(*) FROM "passwords" WHERE (((to_tsvector('simple', coalesce("passwords"."cleartext"::text, ''))) @@ (to_tsquery('simple', ''' ' || 'hello' || ' '''))))
---
  def search
    #@cleartext = Passwords.search_cleartext(params[:q])
    @cleartext = Passwords.where(password: params[:q])
    if @cleartext.empty?