app/controllers/pwhashes_controller.rb

  def index
    @pwhashes = Pwhashes.all.includes(:type, :password, :status)
---
SELECT "passwords".* FROM "passwords" WHERE "passwords"."id" IN (1)
SELECT "pwhashes".* FROM "pwhashes"
SELECT "types".* FROM "types" WHERE "types"."id" IN (4, 5, 6, 7, 8)

  def cleartext_lookup
    @pwhashes = Pwhashes.where(password_id: params[:id]).includes(:type, :password)
    if @pwhashes.empty?
---
SELECT "passwords".* FROM "passwords" WHERE "passwords"."id" IN (1)
SELECT "pwhashes".* FROM "pwhashes" WHERE "pwhashes"."password_id" = 1 ORDER BY "pwhashes"."id" ASC LIMIT 1
SELECT "types".* FROM "types" WHERE "types"."id" IN (4, 5, 6, 7, 8)
SELECT "passwords".* FROM "passwords" WHERE "passwords"."id" = $1 ORDER BY "passwords"."id" ASC LIMIT 1  [["id", 1]]
SELECT "types".* FROM "types" WHERE "types"."id" = $1 ORDER BY "types"."id" ASC LIMIT 1  [["id", 4]]